app/Http/Controllers/AdminController.php

    public function dashboard()
    {
        $today = now()->toDateString();

        $totalStudents = Student::count();
        $presentToday = Attendance::whereDate('attendance_date', $today)
            ->whereHas('status', function ($q) {
                $q->where('status_name', 'Hadir');
            })->count();
---
select count(*) as aggregate from `attendances`