app/Http/Controllers/PermissionController.php

insert into `permissions` (`student_id`, `image`, `explanation_id`, `updated_at`, `created_at`) values (3, 'permission/6x8m1cZnQfWF6rs9v5tuliWCV8p1CQQnIFpzi7PZ.jpg', '4', '2025-05-30 08:04:13', '2025-05-30 08:04:13')
---
    public function storePermission(Request $request)
    {
        $request->validate([
            'image' => 'required|image|mimes:jpg,png,jpeg|max:5120',
            'explanation' => 'required|exists:statuses,id',
        ]);

        $student = Auth::user()->id;

        $imagePath = $request->file('image')->store('permission', 'public');

        $permission = new Permission();
        $permission->student_id = $student;
        $permission->image = $imagePath;
        $permission->explanation_id = $request->explanation;
        $permission->date = now()->toDateString();
        $permission->save();

select * from `permissions`
---
    public function permissions()
    {
        $permissions = Permission::all();