app/Http/Controllers/StudentController.php

    public function student()
    {
        $user = Auth::user();
        if (!$user || $user->role !== 'student') {
            return redirect()->route('login');
        }

        $attendances = Attendance::with('student')
            ->where('student_id', $user->id)
            ->get();

        $statuses = Status::all();
---
select * from `attendances` where `student_id` = 3
select * from `statuses`

    public function history()
    {
        $user = Auth::user();
        if (!$user || $user->role !== 'student') {
            return redirect()->route('login');
        }

        $permissions = Permission::with('student')
            ->where('student_id', $user->id)
            ->get();

        $attendances = Attendance::with('student')
            ->where('student_id', $user->id)
            ->get();
        $explanation = Status::all();
---
select * from `permissions` where `student_id` = 3
select * from `attendances` where `student_id` = 3
select * from `statuses`

    public function permission()
    {
        $user = Auth::user();
        if (!$user || $user->role !== 'student') {
            return redirect()->route('login');
        }

        $classes = StudentClass::all();
        $statuses = Status::all()->slice(3)->values();
---
select * from `student_classes`
select * from `statuses`